package main

import (
	"github.com/neozmmv/blindspot/cmd"
	"github.com/spf13/cobra"
)

var rootCmd = &cobra.Command{
	Use: "blindspot",
	Short: `
██████╗ ██╗     ██╗███╗   ██╗██████╗ ███████╗██████╗  ██████╗ ████████╗
██╔══██╗██║     ██║████╗  ██║██╔══██╗██╔════╝██╔══██╗██╔═══██╗╚══██╔══╝
██████╔╝██║     ██║██╔██╗ ██║██║  ██║███████╗██████╔╝██║   ██║   ██║   
██╔══██╗██║     ██║██║╚██╗██║██║  ██║╚════██║██╔═══╝ ██║   ██║   ██║   
██████╔╝███████╗██║██║ ╚████║██████╔╝███████║██║     ╚██████╔╝   ██║   
╚═════╝ ╚══════╝╚═╝╚═╝  ╚═══╝╚═════╝ ╚══════╝╚═╝      ╚═════╝    ╚═╝   
                                                                                       
P2P Toolkit: VPN, File Sharing, Chat, and More
	`,
}

func init() {
	rootCmd.AddCommand(cmd.ConnectCmd)
	rootCmd.AddCommand(cmd.DisconnectCmd)
	rootCmd.AddCommand(cmd.ListCmd)
	rootCmd.AddCommand(cmd.ChatCmd)
	rootCmd.AddCommand(cmd.IPCmd)
	rootCmd.AddCommand(cmd.SendCmd)
	rootCmd.AddCommand(cmd.ReceiveCmd)
	rootCmd.AddCommand(cmd.VersionCmd)
}

func main() {
	rootCmd.Execute()
}
